Tekla.Structures.Analysis.AnalysisModel
The AnalysisModel class contains information related to analysis models.
using Tekla.Structures.Analysis;
public class Class
{
public void Example()
{
Analysis Analysis = new Analysis();
AnalysisObjectSelector AnalysisObjectSelector = Analysis.GetAnalysisObjectSelector();
AnalysisObjectEnumerator AnalysisObjectEnumerator = AnalysisObjectSelector.GetAllObjectsWithType(AnalysisObject.AnalysisObjectEnum.ANALYSIS_MODEL, "");
while(AnalysisObjectEnumerator.MoveNext())
{
AnalysisModel AnalysisModel = AnalysisObjectEnumerator.Current as AnalysisModel;
if(AnalysisModel == null) continue;
}
}
}

Tekla.Structures.Analysis.AnalysisModel._ConstructionMethod
The construction method of the analysis model.

Tekla.Structures.Analysis.AnalysisModel._FilterName
The filter name of the analysis model.

Tekla.Structures.Analysis.AnalysisModel._AnalysisMethod
The analysis method of the analysis model.

Tekla.Structures.Analysis.AnalysisModel._AnalysisEngine
The analysis engine of the analysis model.

Tekla.Structures.Analysis.AnalysisModel._UseModelMerge
This indicates whether model merge is used.

Tekla.Structures.Analysis.AnalysisModel._NumberOfIterations
The number of iterations of the analysis model.

Tekla.Structures.Analysis.AnalysisModel._IncludeImperfections
Gets or sets a value indicating whether imperfections are to be included.

Tekla.Structures.Analysis.AnalysisModel._RelativeAccuracy
The relative accuracy of the analysis model.

Tekla.Structures.Analysis.AnalysisModel._ModelUpdateModificationIdentifier
The identifier of the model update modification.

Tekla.Structures.Analysis.AnalysisModel._ResultsModificationIdentifier
The results modification identifier.

Tekla.Structures.Analysis.AnalysisModel._ResultsTime
The results time.

Tekla.Structures.Analysis.AnalysisModel._ResultsFrozen
Gets or sets a value indicating whether the results are frozen.

Tekla.Structures.Analysis.AnalysisModel._PhysicalFrozen
Gets or sets a value indicating whether the physical objects are frozen.

Tekla.Structures.Analysis.AnalysisModel._BracingFilterName
The name of the bracing filter.

Tekla.Structures.Analysis.AnalysisModel._SecondaryFilterName
The name of the secondary filter.

Tekla.Structures.Analysis.AnalysisModel._NodePositionTolerance
The node position tolerance.

Tekla.Structures.Analysis.AnalysisModel._SnapDistance
The snap distance value.

Tekla.Structures.Analysis.AnalysisModel._UseTrueCurvedMembers
Gets or sets a value indicating whether curved members are used.

Tekla.Structures.Analysis.AnalysisModel._UseTwinProfiles
Gets or sets a value indicating whether twin profiles are used.

Tekla.Structures.Analysis.AnalysisModel._AnalysisConnectivityRules
The analysis model connectivity rules.

Tekla.Structures.Analysis.AnalysisModel._MemberAxislocation
The axis location of the members.

Tekla.Structures.Analysis.AnalysisModel._MemberEndReleaseMethodByJoint
Gets or sets a value indicating whether the end releases are set by joint properties.

Tekla.Structures.Analysis.AnalysisModel._AnalysisModelDesignProperties
The analysis model design properties.

Tekla.Structures.Analysis.AnalysisModel._AnalysisModelJobProperties
The analysis model job properties.

Tekla.Structures.Analysis.AnalysisModel._AnalysisModelModalAnalysisProperties
The analysis model modal analysis properties.

Tekla.Structures.Analysis.AnalysisModel._AnalysisModelOutputProperties
The analysis model output properties.

Tekla.Structures.Analysis.AnalysisModel._AnalysisModelSeismicProperties
The analysis model seismic properties.

Tekla.Structures.Analysis.AnalysisModel._AnalysisModelSpectrumProperties
The analysis model spectrum properties

Tekla.Structures.Analysis.AnalysisModel._AnalysisParts
The analysis parts of the analysis model.

Tekla.Structures.Analysis.AnalysisModel._AnalysisNodes
The user defined analysis nodes of the analysis model.

Tekla.Structures.Analysis.AnalysisModel._AnalysisNodeLinks
The user defined analysis node links of the analysis model.

Tekla.Structures.Analysis.AnalysisModel._AnalysisRigidDiaphragms
The user defined analysis rigid diaphragms of the analysis model.

Tekla.Structures.Analysis.AnalysisModel._AnalysisLoadGroups
The user defined analysis load groups of the analysis model.

Tekla.Structures.Analysis.AnalysisModel._AnalysisLoadCombinations
The user defined analysis load combinations of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.SelectName
Selects analysis model name.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisModel.PART_DEFAULTS_MODEL_NAME
The analysis model name for default analysis properties of a part.

Tekla.Structures.Analysis.AnalysisModel.ConstructionMethod
The construction method of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.FilterName
The filter name of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisMethod
The analysis method of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisEngine
The analysis engine of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.UseModelMerge
Indicates whether model merge is used.

Tekla.Structures.Analysis.AnalysisModel.NumberOfIterations
The number of iterations of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.IncludeImperfections
Indicates whether imperfections are to be included.

Tekla.Structures.Analysis.AnalysisModel.RelativeAccuracy
The relative accuracy of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.ModelUpdateModificationIdentifier
The identifier of the model update modification.

Tekla.Structures.Analysis.AnalysisModel.ResultsModificationIdentifier
The results modification identifier.

Tekla.Structures.Analysis.AnalysisModel.ResultsTime
The results time.

Tekla.Structures.Analysis.AnalysisModel.ResultsFrozen
Indicates whether the results are frozen.

Tekla.Structures.Analysis.AnalysisModel.PhysicalFrozen
Indicates whether the physical objects are frozen.

Tekla.Structures.Analysis.AnalysisModel.ResultsFreezed
Indicates whether the results are frozen.
Deprecated since TS2018, use ResultsFrozen.

Tekla.Structures.Analysis.AnalysisModel.PhysicalFreezed
Indicates whether the physical objects are frozen.
Deprecated since TS2018, use PhysicalFrozen.

Tekla.Structures.Analysis.AnalysisModel.BracingFilterName
The bracing filter name.

Tekla.Structures.Analysis.AnalysisModel.SecondaryMemberFilterName
The secondary member filter name.

Tekla.Structures.Analysis.AnalysisModel.AutodetectSecondaries
Indicates whether bracing members are detected automatically.
Deprecated since TS2018, analysis model no longer has this property.

Tekla.Structures.Analysis.AnalysisModel.SecondaryFilterName
The old secondary filter name.
Named now as bracing.
Deprecated since TS2018, use BracingFilterName instead.

Tekla.Structures.Analysis.AnalysisModel.SecondaryKeepAxis
The secondary keep axis settings.
Not used, bracing/secondary members always have KEEP_AXIS_NO initially.
Deprecated since TS2018.

Tekla.Structures.Analysis.AnalysisModel.NodePositionTolerance
The node position tolerance of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.SnapDistance
The snap distance of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.UseTrueCurvedMembers
Indicates whether members are true curved.

Tekla.Structures.Analysis.AnalysisModel.UseTwinProfiles
Indicates whether twin profiles are used.

Tekla.Structures.Analysis.AnalysisModel.AnalysisConnectivityRules
The analysis model connectivity rules.

Tekla.Structures.Analysis.AnalysisModel.MemberAxislocation
The axis location of the members.

Tekla.Structures.Analysis.AnalysisModel.MemberEndReleaseMethodByJoint
Indicates whether the end releases are set by joint.

Tekla.Structures.Analysis.AnalysisModel.AnalysisModelDesignProperties
The analysis model design properties.

Tekla.Structures.Analysis.AnalysisModel.AnalysisModelJobProperties
The analysis model job properties.

Tekla.Structures.Analysis.AnalysisModel.AnalysisModelModalAnalysisProperties
The analysis model modal analysis properties.

Tekla.Structures.Analysis.AnalysisModel.AnalysisModelOutputProperties
The analysis model output properties.

Tekla.Structures.Analysis.AnalysisModel.AnalysisModelSeismicProperties
The analysis model seismic properties.

Tekla.Structures.Analysis.AnalysisModel.AnalysisModelSpectrumProperties
The analysis model spectrum properties

Tekla.Structures.Analysis.AnalysisModel.AnalysisParts
The analysis parts of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisNodes
The user defined analysis nodes of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisNodeLinks
The user defined analysis node links of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisRigidDiaphragms
The user defined analysis rigid diaphragms of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisLoadGroups
The user defined analysis load groups of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisLoadCombinations
The user defined analysis load combinations of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.Insert
Inserts a new analysis model into the Tekla Structures model.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisModel.Select
Selects an analysis model.
The AnalysisModelName or ID has to be set.

Tekla.Structures.Analysis.AnalysisModel.Modify
Modifies an analysis model.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisModel.Delete
Deletes an analysis model.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisModel.InsertInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModel.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModel.SelectInstanceName
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModel.ModifyInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModel.DeleteInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModel.CollectData
Collects additional data.